print('===============  TASK №* ======================================================================')
# Задача  со звездочкой
# Дана строка
# '{"perm":{"entityType":"COMPANY"},"parentId":-4270,"value":["85166"]}'
# Вінести число 85166
# в отдельную переменную и написать код форматирования исходной строки так чтобі Мі ето число вставляли как переменную
# Смотрите тему форматирование строк

int_num = 85166
print('{"perm":{"entityType":"COMPANY"},"parentId":-4270,"value":["%s"]}' % int_num )


# print('===============  TASK №1 ======================================================================')
#
# list1 = [1, 3, 4, 56, 7, 8, 25]
# sum = 0
# while list1:
#     sum += list1.pop(0)
# print(sum)
#
# print('===============  TASK №2 ======================================================================')
#
# a = float(input(' введіть число а у проміжку де 1<a<1.5   '))
# i = 2
# while ( (1+1/i) >= a):
#     print(1 + 1 / i)
#     i += 1
#
#
# print('===============  TASK №3 ======================================================================')
# list3 = [ "Su","Mn","Tu", "We", "Th", "Fr", "St"]
# n = int (input(' введіть день 2023 року  -  '))+6
# print ( n, "- день у 2023 це -", list3[n%7-1] )
#
# print('===============  TASK №4 ======================================================================')
#
# list3 = ["ojkdfddejjjjjjdseiue", "sdsfdpopwem,m", "banana", "kjkjasdssssssss", "sdsdsdsdsdsds", "sjkkjhjsidbww"]
# n = input(' введіть вимвол для підрахунку кількості символів що входять в рядок -  ')
# for s in list3:
#     print("символ <", n, "> повторюється ", s.count(n), " разів в рядку - ", s)
#
# print('===============  TASK №5 ======================================================================')
# list5 = [ 44, 23, 34, 56, 57, 48, 85, 76, 42, 12, 37, 99, 53, 91, 35, 86, 99]
# print ( list5)
# n = int(input(' введіть число для перевірки входження в список -  '))
# if n in list5 :
#     print ( "число - ", n, " входить в заданий список чисел")
# else:
#     print("число - ", n, " не входить в заданий список чисел")
#
# print('===============  TASK № 2.1 ======================================================================')
# list_a = [1, 2, 3, 4]
# list_b = [5, 6, 7, 8]
#
# list_resolt = list(zip(list_a,list_b))
# print(list_resolt)
#
#
# print('===============  TASK № 2.2 ======================================================================')
# list_d = ["bar", "baz", "qux", "etc"]
# tuple_d = ("foo",*list_d)
# print(tuple_d)
